ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/EVENTLP_1.0.xml
        <register id="EVENTLP_DIAGPAR171" width="32" offset="0x140" description="Diagnostic Parity Register 171">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR170" width="32" offset="0x144" description="Diagnostic Parity Register 170">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR169" width="32" offset="0x148" description="Diagnostic Parity Register 169">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR168" width="32" offset="0x14C" description="Diagnostic Parity Register 168">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR167" width="32" offset="0x150" description="Diagnostic Parity Register 167">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR166" width="32" offset="0x154" description="Diagnostic Parity Register 166">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR165" width="32" offset="0x158" description="Diagnostic Parity Register 165">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR164" width="32" offset="0x15C" description="Diagnostic Parity Register 164">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR163" width="32" offset="0x160" description="Diagnostic Parity Register 163">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR162" width="32" offset="0x164" description="Diagnostic Parity Register 162">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR161" width="32" offset="0x168" description="Diagnostic Parity Register 161">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
        <register id="EVENTLP_DIAGPAR160" width="32" offset="0x16C" description="Diagnostic Parity Register 160">
            <bitfield id="ASSERTDIAG" description="Writing a 1 will cause the safety diagnostic logic to generate a diagnostic check." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="No Effect"/>
                <bitenum id="START" value="0x1" description="Generate diagnostic check"/>
            </bitfield>
        </register>
